# Index Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewPrintedEventArgs..::..Index Property
ViewPrintedEventArgs Class See Also
---
The index of the view being printed out of the set of all views being printed.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public int Index { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Index As Integer
	Get
```

Visual C++
---
```text
public:
property int Index {
	int get ();
}
```

# Remarks
The index is zero-based. When a single view is being printed, this value should be 0.
# See Also
ViewPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace